/**
 * 输出方法：
 * element.innerHtml
 * document.write ：DOM加载完成后执行，会将覆盖全部的内容，否则是按照顺序写入文档
 * alert()
 * window.print() 访问打印设备
 */

/**
 * 标识符
 * 首个字符只能是
 * 字母(A-Z|a-z)
 * $
 * 下划线_
 * 大小写敏感
 * 不能使用中划线
 *
 * JavaScript的字符集：unicode 字符集
 */

/*
 var let cont
 逗号分隔，可以一行声明多个变量
 var 可以重复声明同一个变量
 let const 同一作用域不可以重复声明，没有变量提升
 const 声明时必须初始化，且变量不可改变
 */

/*
操作符 
运算符
+
-
*
/
**
%
++
--
字符串操作符
+
比较符
>
<
==
===
>=
!=
!==
>=
<=

逻辑运算符
&&
||
!
三元符
?
类型操作
typeof
instanceof
二进制操作符
&
|
~
^
<<
>>
>>>
属性检测
in
null值检测
??
?.
yield 暂停功能
, 逗号
 */

/*
JavaScript 具有动态类型
同一变量可以接收不同的数据类型的值
*/

/*
 事件，原生事件中，事件属性后跟的是需要执行的代码片段
 onclick="alert(111)"
 */
